insert into Book(ID, name, author, price, type, brief, publish_Date, press, store, num, image) 
value('1', '一本书看透股权架构', '李利威', 20.99, '经济', 
'本书作者拥有律师、注册会计师、注册税务师执业经历，服务过联想控股、拉卡拉等百余家公司的股权设计项目。本书是其15年实战经验的系统总结。
本书四大特点：
1. 模型化
书中归纳了股权架构的9种应用模型，不仅可以让读者快速理解股权本质，还可以让股权设计变得更高效。
2. 系统性
本书打通了法律、财务、税务、管理4个领域的边界，避免了股权设计中“只见树木不见森林”的误区 。
3. 场景化
以30家名企案例贯穿始终，让读者在似曾相识的场景中产生共鸣，启发其思考。
4. 实操性
全书以指导股权实战为宗旨，每节均包含案例、模型及操作要点提示，是本超级实用的股权架构设计指南。',
'2019-04-01', '机械工业出版社', 4, 4, '/static/b1.jpg');

insert into Book(ID, name, author, price, type, brief, publish_Date, press, store, num, image) 
value('2', '一本书读懂ChatGPT', '石子言、姚芳', 19.99, '科技', 
'ChatGPT是人工智能研究实验室OpenAI推出的一款基于AI的自然语言处理工具，旨在基于人们输入的内容生成类似的人类语言，凭借其强大的语言理解和文本生成能力，一经发布就引爆全球技术圈，被认为可广泛应用于文字模态的AIGC应用、代码开发、图像生成、智能客服等多个领域。
ChatGPT的横空出世，预示着人工智能（AI）无论在经济性与可获得性上都达到了支持普及的水平，ChatGPT的成功必将产生的鲇鱼效应，推动全球AI产业化进程的全面提速，预示着AI领域一个崭新的智能新时代将全面到来。 
本书从ChatGPT的前世今生入手，阐述ChatGPT产生的背景和发展历程，梳理当前主流的AI技术，并由此引出ChatGPT的模型及实现原理的介绍，将ChatGPT与传统机器学习、深度神经网络等AI技术进行对比，在此基础上，介绍在文本生成、脚本编程、文本翻译等领域中ChatGPT的应用，进一步总结归纳其未来的发展趋势，及其对未来AI领域发展的影响。',
'2023-04-01', '东方出版社', 5, 5, '/static/b2.jpg');

insert into Book(ID, name, author, price, type, brief, publish_Date, press, store, num, image) 
value('3', '思考的框架', '沙恩·帕里什', 38.30, '人文社科', 
'无论是在商业世界中还是在生活中，盲点更少的人往往能够胜出。俗语说：“手里只有一把锤子，那你看什么都像钉子。”世界纷繁复杂，事物之间彼此关联，只有通过理解多种模型才能加以解释。
因此，要消除盲点就意味着要运用不同的视角和模型来思考问题。掌握多种思维模型意味着我们能更深刻地理解世界运转的法则，从而找到更便捷的流程，从多个维度和角度来解决问题。
为对的问题找到对的解决方法，这种技能就是智慧的体现。
这本书谈论的就是如何寻求这种智慧。思维模式决定了你的高度，这是未来商业和职场中需要的竞争力。 思考的质量和高度取决于我们使用的思维模型。',
'2023-01-01', '中信出版社', 3, 3, '/static/b3.jpg');

insert into Book(ID, name, author, price, type, brief, publish_Date, press, store, num, image) 
value('4', ' 1984', '乔治·奥威尔', '22', '人文社科', 
'《1984》是奥威尔的传世之作，是世界文坛中著名的反乌托邦和反极权的政治讽喻小说。
小说创作于1948年，作者将48倒置过来为84作为书名。本书讲述一个实行高度集权统治，以改变历史、改变语言、打破家庭等极端手段钳制人们的思想和本能，以具有监视与监听功能的“电幕”控制人们的行为，以对领袖的个人崇拜和对国内外敌人的仇恨来维持社会运转假想的社会，通过对这个社会中一个普通人温斯顿·史密斯的生活，投射出了现实生活中极权主义的本质。
每个经历或熟知这类历史事件的人，在看过《1984》后都会产生某种触目惊心的契合感。它犹如如一个鲜明的标签，它警醒着世人，莫让这种预言中的黑暗成为现实。',
'2016-04-25', '群言出版社', 5, 5, '/static/b4.jpg');

insert into Book(ID, name, author, price, type, brief, publish_Date, press, store, num, image) 
value('5', '法治的细节', '罗翔', '24.90', '法律',
'《法治的细节》是中国政法大学法学教授罗翔全新的法学随笔，面向大众读者，从热点案件解读、法学理念科普、经典名著讲解等6大板块，普及法律常识与法治观念。内容包括辛普森案、电车难题、性同意制度等法律基本常识，或N号房、张玉环案等时事热点的案件，多维度培育法律思维，助力法治社会的构建，点亮每个人心中的法治之光。',
'2012-11-01', '云南人民出版社', 7, 7, '/static/b5.jpg');

insert into Book(ID, name, author, price, type, brief, publish_Date, press, store, num, image) 
value('6', '飞鸟集', '罗宾德拉纳特·泰戈尔', '19.70', '文学',
'1916年第一次世界大战期间，因获得诺贝尔文学奖而在国际上名声大噪的泰戈尔到访日本。他被那里的生活和风光深深吸引，并接触到日本古典短诗——俳句。那些罕见的短诗或许在他身上产生了影响。他应青年们的要求，在他们的扇子或签名簿上写下一些文字，这些零星的词句或短文后来集结成《飞鸟集》出版。
《飞鸟集》是一部富于哲理的英文格言诗集，初版于1916年，收录了326首诗，包含泰戈尔孟加拉语短诗的英译文，以及访日时的即兴英文诗作。
《飞鸟集》中的诗歌凝炼短小，描写对象多为花草树木、风雨雷电、日月星辰等微小而简单的事物，但这些恰恰构成了生命中最重要的部分，在对这些事物的细腻观察和歌颂中，蕴含了泰戈尔的哲学思考，充分展示了诗人对自然和生命的热爱。',
'2015-07-01', '浙江文艺出版社', 6, 6, '/static/b6.jpg');

insert into Book(ID, name, author, price, type, brief, publish_Date, press, store, num, image) 
value('7', '边城', '沈从文', '15.00', '小说', 
'《边城》是沈从文的代表作，是一部中篇小说，凭此书一举奠定了其在文学史上的重要地位。书中寄托着作者关于“美”与“爱”的美学理想，是较能表现人性美的一部作品。
小说以20世纪30年代川湘交界的边城小镇茶峒为背景，以兼具抒情诗和小品文的优美笔触，描绘了湘西边城淳朴的世道民风和天然的生活状态。
全书共二十一个章节，每个章节都似一幅或浓或淡的水墨画，以古朴清新的语言，表现出一种“优美、健康、自然而又不悖乎人性的人生形式”',
'2018-07-01', '湖南文艺出版社', 9, 9, '/static/b7.jpg');

insert into Book(ID, name, author, price, type, brief, publish_Date, press, store, num, image) 
value('8', '活着', '余华', '13.49', '小说',
'《活着》是一部充满血泪的小说。余华通过一位中国农民的苦难生活讲述了人如何去承受巨大的苦难；讲述了眼泪的丰富和宽广；讲述了绝望的不存在：讲述了人是为了活着本身而活着……
《活着》讲述了农村人福贵悲惨的人生遭遇。福贵本是个阔少爷，可他嗜赌如命，终于赌光了家业，一贫如洗。
他的父亲被他活活气死，母亲则在穷困中患了重病，福贵前去求药，却在途中被国民党抓去当壮丁。经过几番波折回到家里，才知道母亲早已去世，妻子家珍含辛茹苦地养大两个儿女。
此后更加悲惨的命运一次又一次降临到福贵身上，他的妻子、儿女和孙子相继死去，最后只剩福贵和一头老牛相依为命，但老人依旧活着，仿佛比往日更加洒脱与坚强。',
'2008-05-01', '作家出版社', 4, 4, '/static/b8.jpg');

insert into Book(ID, name, author, price, type, brief, publish_Date, press, store, num, image) 
value('9', '白鹿原', '陈忠实', '9.99', '小说',
'白鹿原》是渭河平原50年变迁的雄奇史诗，一轴中国农村斑斓多彩，触目惊心的长幅画卷。主人公六娶六丧，神秘的序曲预示着不祥。
一个家庭两代子孙，为争夺白鹿原的统治代代争斗不已，上演了一幕幕惊心动魄的话剧；巧取风水地，恶施美人计，孝子为匪，亲翁杀媳，兄弟相煎，情人反目……',
'2012-10-01', '人民文学出版社', 7, 7, '/static/b9.jpg');

insert into Book(ID, name, author, price, type, brief, publish_Date, press, store, num, image) 
value('10', '西方哲学史', '伯特兰·罗素', '10.90', '宗教哲学',
'《西方哲学史》写作于二战期间，源自罗素在美国费城的一系列哲学史讲座。全书共分三卷，按时间顺序依次讲述古代哲学、天主教哲学和近代哲学。
在本书中，罗素从一位哲学家的视角，完整地展现出他对西方哲学历史发展的理解，其中既包括对重要哲学家的哲学观点的讲述，也包含罗素本人对这些思想的批判。
本书将罗素原著七十万字的内容凝练为不到二十万字，既保留了原著中最重要的思想观点与分析论证，也更贴合当下读者快速掌握、理解经典的阅读习惯，便于读者从多方面把握本书的精彩内容。',
'2022-01-20', '万卷出版公司', 3, 3, '/static/b10.jpg');

insert into Book(ID, name, author, price, type, brief, publish_Date, press, store, num, image) 
value('11', '中国近代史', '蒋廷黻', '21.00', '历史',
'近代中华民族根本只有一个问题，那就是：中国人能近代化吗？能赶上西洋人吗？能利用科学和机械吗？能废除我们家族和家乡观念而组织一个近代的民族国家吗？能的话，我们民族的前途是光明的；不能的话，我们这个民族是没有前途的。因为在世界上，一切的国家能接受近代文化者必致富强，不能者必遭惨败，毫无例外。
从鸦片战争到抗日战争，蒋廷黻以独特的内政与外交并重的视角，将中国近代历史变迁凝练在一条主线、四大主题中，为读者提供了洞悉中国近代史的整体性视角。',
'2023-05-01', '广东人民出版社', 5, 5, '/static/b11.jpg');

insert into Book(ID, name, author, price, type, brief, publish_Date, press, store, num, image) 
value('12', '线性代数', '同济大学数学系', '14.90', '数理科学',
'本书根据工科类本科“线性代数”课程教学基本要求，参考同济大学“线性代数”课程及教材建设的经验和成果，按照硕士研究生考研大纲的要求编写而成。
编者在内容编排、概念叙述、定理证明等诸多方面都做了精心安排，以使全书结构流畅，主次分明，通俗易懂。
本书共分五章，包括线性方程组与矩阵、方阵的行列式、向量空间与线性方程组解的结构、相似矩阵及二次型、线性空间与线性变换．每小节配有习题，每章末配有拓展阅读和测试题，拓展阅读用于讲解线性代数发展的相关知识；测试题难度高于习题难度，用于学生加强练习，部分习题和测试题答案放于本书**后章节。
另外，为了更加清楚地讲解每章的重点、难点以及典型例题，本书还配有微课视频． 本书可作为高等院校非数学类专业“线性代数”课程的教材，也可作为自学者的参考书。',
'2017-01-01', '人民邮电出版社有限公司', 2, 2, '/static/b12.jpg');

insert into Book(ID, name, author, price, type, brief, publish_Date, press, store, num, image) 
value('13', '随机过程', '何书元', '13.74', '数理科学', 
'《随机过程》是高等院校随机过程课程的教材，《随机过程》共分七章，内容包括：概率统计、泊松过程、更新过程、离散时间马尔可夫链、连续时间马尔可夫链、布朗运动和应用举例，每小节配有练习题，每章配有总习题，书末附有习题答案或提示，供读者参考，《随机过程》对实际应用中常见的随机过程作了较为系统的介绍，有许多新的简明讲法，方便读者更好地理解随机过程的概念和主要定理。
《随机过程》叙述严谨、举例丰富，精选的例题反映了应用随机过程的特点，例如：候车问题、排队问题、系统维修问题、互联网的PageRank问题、生灭过程、简单的传染病模型等，《随机过程》在介绍随机过程的同时也介绍了随机过程参数估计的基本方法，为的是方便实际工作者的应用，《随机过程》在定理的叙述和证明上尽量降低难度和避免复杂的数学推导，同时兼顾理论体系的完整。',
'2008-11-01', '北京大学出版社', 8, 8, '/static/b13.jpg');

# 插入管理员
insert into administrator value('1', '张三', '男', '13698485343', '00000zs');
insert into administrator value('2', '李四', '男', '18745623039', '11111ls');
insert into administrator value('3', '王五', '女', '17496234276', '22222ww');
